Autodesk.Revit.DB.Structure.BendingDetailLevelOfDetail
Describes the level of detail in which the Bending Detail will be represented.
Since:
2024
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailLevelOfDetail.Fine
Ribbon representation of Bending Detail.

Autodesk.Revit.DB.Structure.BendingDetailLevelOfDetail.Coarse
Centerline representation of the Bending Detail.

Autodesk.Revit.DB.Structure.BendingDetailLevelOfDetail.ByView
The level detail is taken from the view.